{
  "testTitle": "STAAR Grade 6 Reading, May 2018",
  "passages": [
    {
      "id": 1,
      "title": "The Regulars",
      "text": "1 'Turkey Melt,' 'Corned Beef on Rye,' and 'Ham and Cheese' waved good-bye. 2 They were three of the regulars at my parents' deli. 3 Every day Mr. and Mrs. Sandlin shared a turkey-melt sandwich, Mr. Augsburger had a corned beef on rye bread, and Mr. Bates ordered ham and cheese on whole wheat from his perch on the stool beside the cash register. 4 I didn't even know their real names until one very eventful day at the deli. 5 It was the day of the Twin Rivers Summer Festival, and I had just been told that I had to help at the deli that afternoon instead of enjoying the event with my friends Lisa and Carlos. 6 'Can't we hire extra help?' I complained. 7 'There's not enough time to train someone else,' Mom responded. 8 'Plus, they wouldn't know our customers. We have to take care of our regulars because they're part of what makes Sam's Deli a special place.' 9 I had to admit that Sam's Deli served good sandwiches, but I didn't think our sandwiches were that special. And I wouldn't exactly consider Sam's Deli an exciting place to hang out. A TV in the corner and people strolling past the deli's windows were about the only sources of entertainment. Sometimes people chatted with one another about the local news, but overall our days at the deli were quiet. 10 I know Mom and Dad appreciated our regular customers' business. I just couldn't understand why they fussed over them so much. Personally, I didn't think it would hurt for some of our regulars to try a new restaurant every now and then-or at least consider ordering a different type of sandwich. 11 'Where is Dad?' I thought to myself as I wiped off plastic menus. He had left more than an hour ago to drop off a delivery for the fire department, which was running a booth at the festival. 12 My friends and I had been excited to hear that the fire department was planning to spray children at the festival with water to keep them cool. 'Lisa and Carlos are probably soaked by now,' I thought glumly. 13 'Thanks for cleaning the menus,' said Mom as she gathered her items for the festival's pie-judging contest. 'Your dad and I appreciate your help.' 14 Mom glanced at her watch. 'I need to leave now, Eric. But your dad should be here soon. When I get back, you can meet up with your friends for the concert and the fireworks tonight,' Mom promised. 15 By this time the deli had no customers except the regulars. 16 'Everyone else is enjoying the festival,' I thought to myself as I wistfully watched excited festival attendees walk by the deli window en route to the parade. 17 Soon, though, the parade was over, and Dad was still not back. A solid wall of hungry people entered the deli's door. 18 'What's today's lunch special?' one customer called out. 19 'Why don't they have more people working here?' I heard another complain. 20 I methodically took care of one order after another. I thought I was doing all right considering the crowd, but I had no time for all the other details of running a restaurant, like cleaning tables. Plus, I was running low on ice. It seemed that the machine wasn't working as usual. 21 Then, the next moment I had a chance to look up, Ham and Cheese handed me two large bags of ice. 22 'Your parents get ice from down the street when your ice maker doesn't keep up,' he informed me. 'I'm Mr. Bates, by the way. The Sandlins and Mr. Augsburger and I will help you out till your folks get back.' 23 As I thanked him, I noticed that the Turkey Melts were making room for new customers by cleaning tables as quickly as they were vacated. 24 Together the regulars and I managed the crowd. I took orders and made sandwiches while they kept the restaurant clean and visited with customers. 25 'Remember the time Sam's car broke down?' Ham and Cheese asked. 'We delivered sandwiches by bicycle!' 26 Corned Beef on Rye replied. 27 As the tidal wave of customers trickled to a stream, Mom and Dad rushed into the deli. 28 'I couldn't get through because of traffic,' explained Dad. 29 'And I just got finished with the contest,' Mom said, looking anxious. 30 'It's all right,' I replied with a smile. 'I had good help.' 31 'Eric, why don't you take a break and go find your friends?' Dad suggested. 32 'Maybe later,' I said. 'I have a few more orders to fill.' 33 'We can take care of them,' Mom said. 'Especially after what you've been through.' 34 'That's O.K.,' I said. 'These are special orders, the most important ones of the day. After all, you have to take care of your regulars.' 35 Carefully, I began making a turkey melt, a corned beef on rye, and a ham-and-cheese sandwich on whole wheat bread.",
      "images": ["image_deli_scene.jpg"]
    },
    {
      "id": 2,
      "title": "Hidden in Abuelita's Soft Arms",
      "text": "1 Wrinkled and brown like an old paper bag, Abuelita¹ smiles with her too-perfect white teeth, And she calls out as I run from Papa's old, gray station wagon, 'Mi cielo, come here! I need a big abrazo from you!' 5 And I bury myself deep, hidden in Abuelita's soft arms, Smelling like perfume and frijoles and coffee and candy. A whole weekend with Abuelita! I shout, 'Bye, Papa!' Papa smiles and drives off in a puff of white smoke. 10 I bury my face deeper into her, Just me and Abuelita, For the whole weekend. We march happily into her house Painted yellow-white like a forgotten Easter egg, 15 And cracked here and there like that same egg. But it is her home, Near the freeway and St. Agnes Church. On the wall there are pictures of Mama and my two aunts. And there's one of Abuelita, so young and beautiful, 20 Standing close to Abuelito on their wedding day. 'Mi cielo,' Abuelita says holding my sweaty cheeks in her Cool, smooth hands. 'You are so big! My big boy!' And I laugh and stand on my toes to be even bigger. 25 And I bury myself deep, hidden in Abuelita's soft arms, Smelling like perfume and frijoles and coffee and candy. From: LOVE TO MAMÁ A TRIBUTE TO MOTHERS. Poem by Daniel A. Olivas. Copyright © 2001 by Daniel Olivas. Permission arranged with LEE & LOW BOOKS, INC. New York, NY 10016. All rights not specifically granted herein are reserved. 1 Abuelita is the Spanish word for 'grandmother.'",
      "images": []
    },
    {
      "id": 3,
      "title": "George Washington's Portrait",
      "text": "1 Many artists have hopes that their creations will become well known. But sometimes a work of art achieves greater recognition than the artist might have ever imagined. And in the case of Gilbert Stuart and George Washington, a work of art may not even be completed but still inspire people long afterward. 2 Stuart was a painter who lived from 1755 to 1828. He was known for both his talent as a painter and his charm as a person. He painted the portraits of approximately 1,000 people during his lifetime. Many distinguished and famous people sat for a portrait with him. But instead of making his subjects sit perfectly still, as was commonly practiced at the time, Stuart engaged them in interesting conversation. He wanted his subjects to feel at ease in order to capture their most natural expression and pose. Only then would Stuart paint the person. 3 One of Stuart's aspirations was to paint George Washington. Their meeting was not easy to arrange, but Stuart eventually got the opportunity in 1796. Stuart had a difficult time getting Washington to be comfortable. The president finally relaxed when Stuart began to talk about horses. This was one of Washington's favorite topics. The men chatted while Stuart painted the then 64-year-old president. Their time together was limited, however. 4 The result was a portrait of just Washington's head and shoulders. The reasons why Stuart never finished the rest of the portrait are uncertain. What is known is that the bottom and left parts of the canvas remained bare, and Stuart persuaded Washington to let him keep the original. Stuart made and sold multiple copies of the portrait in his lifetime-a common practice in the days before cameras. 5 Even unfinished, Stuart's original portrait is considered the definitive representation of George Washington. People have always believed that the portrait truly captures this great man's presence. The image was used on the dollar bill beginning in 1869 and has been featured there ever since. This means just about everyone in the United States has seen this work of art. While it is an amazing portrait, surely even Stuart would be amazed by its lasting popularity.",
      "images": ["image_washington_portrait.jpg"]
    },
    {
      "id": 4,
      "title": "The Story Behind The Silmarillion",
      "text": "1 J. R. R. Tolkien is best known for the world of fantasy he created in the novel The Hobbit and the trilogy The Lord of the Rings. Yet for Tolkien, one important work remained unfinished at his death in 1973. This book was The Silmarillion. 2 Tolkien's novels are based in a fictional world. In that world creatures such as elves and dwarves coexist with ordinary human beings. The Silmarillion can be thought of as a prequel to The Hobbit and The Lord of the Rings. It is an account of the history of this fantasy world before The Hobbit takes place. This history tells about when the villain of that world battled heroes to claim possession of jewels called Silmarilli. 3 But the story of how The Silmarillion was created may be just as interesting as the story told on its pages. It was Tolkien's first and last work. He began working on it in 1917 and continued adding to it and revising it for about 56 years. Tolkien was unable to complete the work before he died, so his son Christopher took on the challenge of finishing it. Tolkien had amassed many writings he wished to include in the book. Christopher thought, however, that presenting all the material would lead only to confusion for the reader, so he decided to select and arrange the pieces that together would create the most complete and understandable history of this fantasy world. 4 To accomplish this task, Christopher enlisted the aid of a friend. Guy Gavriel Kay had always been interested in writing, particularly fantasy. He worked on The Silmarillion with Christopher for approximately a year. This assignment changed Kay's life, and he eventually became a best-selling fantasy writer himself. Kay's work on The Silmarillion undoubtedly provided training and valuable experience on his journey to become an author. 5 The published version of The Silmarillion has five parts, which was what Tolkien wanted. But the parts had not been put together as a whole when Christopher took on the work after his father died. Some stories required organizing, and some parts were still incomplete and needed finishing. 6 The Silmarillion was published in 1977 to mixed reviews. Some people believed it was too different from what they had come to expect from Tolkien's writing. It had a grim mood and a complicated plot. Others were impressed with the masterful editing Tolkien's son had done. They knew that Christopher had started the task with many incomplete pieces. After The Silmarillion, Christopher published more of his father's unfinished writings, including a children's story and a poem about King Arthur. Their publication allowed still more of J. R. R. Tolkien's fantasies to be shared with devoted readers around the world.",
      "images": []
    },
    {
      "id": 5,
      "title": "The Raven and the Star Fruit Tree",
      "text": "1 In the days before boats were used for exploring the seas or trading, there lived two brothers. The older brother was very greedy, but the younger brother was content to live humbly. When their father died, he left behind an enormous inheritance that he wanted to be divided in an extremely uneven way. He left his entire estate-his home and his vast wealth-to his older son but only a small plot in the country, containing a small shack and a single star fruit tree, to his other son. 2 The older son was overjoyed with this arrangement and quickly began living an extravagant lifestyle, eating expensive foods and spending money freely. He despised his brother, who was content living in the simple shack his father had given him. 3 When the season for star fruit came, the tree produced abundantly, and the younger brother cheered himself with the prospect of selling star fruit to support his family. 4 However, an enormous raven visited the tree each morning and ate the fruit. The younger brother saw that his income was quickly disappearing into the belly of the raven, so one morning he waited beneath the tree. 5 When the raven arrived, the younger brother called to him. 'Oh, raven, please don't eat my star fruit. They are all I have, and I cannot support my family if you eat them up.' 6 'Don't be afraid,' said the raven. 'I'll pay you in gold for your star fruit, as I did your father. Make a bag one foot deep to put the gold in.' 7 'I believe you, raven,' the younger brother said. 'Please eat as much as you like.' 8 That night he had his wife make the bag just as the raven instructed. 9 The next day the raven came as usual to eat star fruit. 10 When he was done eating, he flew down into the yard, spread his wings, and said, 'Climb on my back, and bring your bag.' 11 The younger brother complied, and the raven took off, flying over the sea. 12 He landed on a strange uninhabited island with no trees or other plants of any kind. 13 The dirt, however, was made of pure gold, and the raven told the younger brother to fill his sack with it. 14 The younger brother took only what he could easily carry. 15 After returning home, the younger brother spent some of his newfound wealth on his family and shared some of it with others who were in need. 16 One day the younger brother invited the older brother to dinner, but the other refused to come. 17 Again and again the younger brother pleaded, until finally the older brother agreed and visited his brother's house. 18 The older brother was not expecting what he found. Instead of a simple shack, the younger brother had a comfortable home with fine things inside. 19 'Where did you get all these things?' the older brother asked. 20 The younger brother told his brother of the raven. Upon hearing the whole story, the older brother offered to trade his entire inheritance for the star fruit tree. 21 The younger brother replied that he was content with what he had and refused to trade. 22 The next day, however, the older brother went to the star fruit tree and found the raven. 23 'Oh, raven,' he said, 'I have traded with my brother for this tree. Will you take me to the island of gold?' 24 'Of course,' the raven replied. The bird landed in the yard, spread out his wings, and flew the older brother to the island. 25 The older brother, remembering his brother's explanation, had taken with him the largest bag he could find. 26 He filled it with gold and then climbed back onto the raven, but the bird couldn't fly because the bag was too heavy. 27 'You must pour out some of your gold,' the raven said, but the brother refused. 28 'Very well,' said the raven. 29 The bird flew back to the village, leaving the older brother and all his gold on the island. 30 The season for star fruit passed, and the raven no longer visited the star fruit tree. 31 The younger brother wondered what had become of the older brother. 32 The next year, when the star fruit came again, so did the raven. 33 'Raven,' said the younger brother, 'you fly all around the world. Have you seen my brother?' 34 'I have,' said the raven, and explained what had happened. 'Your brother now has all the gold he wants.'",
      "images": []
    },
    {
      "id": 6,
      "title": "Venezuela's Lightning Storms",
      "text": "1 For most people, a lightning storm is a good reason to sit up and take notice-and probably take shelter. But imagine if you lived in a place where lightning storms raged almost every night of the year. There is an area in Venezuela that has this type of lightning. 2 Large storms with frequent lightning provide an amazing light show for up to 300 nights out of every year. This natural phenomenon is called the Relámpago del Catatumbo, or the Catatumbo Lightning. 3 The Catatumbo Lightning happens in the state of Zulia, located in the northwestern part of Venezuela where the Catatumbo River meets Lake Maracaibo. The lightning is unusual for several reasons. For one thing, its predictability is remarkable. Although there have been rare periods when the lightning storms did not occur, for the most part they have been forming over the same area above Lake Maracaibo nightly for centuries. 4 The lightning storms are also amazing because of the frequency of the strikes. The storms can produce between 18 and 60 strikes per minute. That adds up to an average of 1,680 strikes per hour, and storms can last up to 10 hours. This means that the skies are lit with roughly 2.5 million lightning strikes per year. 5 Finally, the Catatumbo Lightning is exceptional because of its beautiful colors. It causes the sky to glow different shades of white, red, and purple. The color of the lightning changes depending on the presence of dust, water, and various gases in the air. 6 The Catatumbo Lightning has become an important part of the history and culture of the area where it occurs. The native people call the lightning rib a-ba, or \"river of fire in the sky,\" and it has always been a part of their daily life. The lightning is mentioned in poetry and songs; the state of Zulia even has a lightning bolt on its flag. 7 The lightning is also credited with ruining a surprise attack on the city of Maracaibo by the English sea captain Sir Francis Drake in 1595. The lightning flashes illuminated Drake's ships, alerting the Spanish forces to their presence. 8 For all these reasons, the lightning is a source of pride for the people of the area, including environmentalist Erick Quiroga, who has been studying the lightning for more than 15 years. \"I saw my first lightning at eight years old,\" he said. \"I thought it was a smile from the night sky.\" 9 No one knows for sure what causes the Catatumbo Lightning. Some scientists think it's caused by increased amounts of methane gas around the area. Others believe the lightning occurs because of the area's unique location-the very hot, humid air from the Catatumbo River and Lake Maracaibo meets cool air that comes down from the Andes mountains. 10 The mystery of what causes the lightning deepened when, beginning in January 2010, the lightning did not appear for a period of several months. During this time Venezuela, like many other parts of the world, was experiencing abnormal weather patterns, and the country was suffering from a severe drought. Some scientists speculate that this may have caused the Catatumbo Lightning to stop, but the answer remains unclear. Whatever the cause, the lightning resumed that April. 11 Even though the exact cause of the Catatumbo Lightning is still unknown, it is a welcome mystery. Quiroga recently asked the Guinness Book of World Records to grant the area around Lake Maracaibo the record for being the place on Earth with the most lightning. This honor had been held by a town in central Africa. In 2014, Guinness agreed to the request, presenting the vice president of Venezuela with a special certificate. Today people from all over the world come to see the brilliant display. And if history is any indication, the Catatumbo Lightning will be impressing visitors and locals alike for many years to come.",
      "images": ["map_venezuela.jpg", "photo_catatumbo_lightning.jpg"]
    }
  ],
  "questions": [
    {
      "id": 1,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Vocabulary",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "What is the meaning of wistfully in paragraph 12?",
      "options": [
        "With sadness",
        "With relief",
        "With anxiety",
        "With curiosity"
      ],
      "correct_answer": "With sadness",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 2,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Figurative Language",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "The author includes the figurative language 'As the tidal wave of customers trickled to a stream' in paragraph 23 to show that the...",
      "options": [
        "customers come in and out of the deli at a steady pace",
        "new customers got wet from the firefighters' hoses at the festival",
        "number of customers at the deli has become manageable",
        "customers are upset at first but calm by the time they leave"
      ],
      "correct_answer": "number of customers at the deli has become manageable",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 3,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Character Development",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "Eric's actions at the end of the story are significant because they reveal that he...",
      "options": [
        "has learned that working in the deli is more fun than being with friends",
        "understands that his parents deserve to rest before they return to work",
        "is ready to accept more responsibilities at the deli",
        "realizes the importance of loyal customers"
      ],
      "correct_answer": "realizes the importance of loyal customers",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 4,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Conflict",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "Which of the following best describes Eric's main conflict in the story?",
      "options": [
        "He does not know the names of the customers who frequently eat at his parents' deli.",
        "He thinks his parents need to offer a better variety of sandwiches at the deli.",
        "He has to help his parents on a day that he has plans with his friends.",
        "He is bothered by the lack of excitement in his parents' deli."
      ],
      "correct_answer": "He has to help his parents on a day that he has plans with his friends.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 5,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Point of View",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "The first-person point of view of the story allows the reader to understand the...",
      "options": [
        "actions of only the regulars at the deli",
        "narrator's changing perspective on the busy deli",
        "reasons the narrator's parents are not at the deli",
        "inner thoughts of the customers at the deli"
      ],
      "correct_answer": "narrator's changing perspective on the busy deli",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 6,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Theme",
      "type": "multiple-choice",
      "passageId": 1,
      "question": "Which sentence from the story best expresses its theme?",
      "options": [
        "'We have to take care of our regulars because they're part of what makes Sam's Deli a special place.'",
        "Personally, I didn't think it would hurt for some of our regulars to try a new restaurant every now and then...",
        "'Your dad and I appreciate your help.'",
        "I took orders and made sandwiches while they kept the restaurant clean and visited with customers."
      ],
      "correct_answer": "'We have to take care of our regulars because they're part of what makes Sam's Deli a special place.'",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 7,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Poetry Analysis",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "In lines 5 and 25, the words 'bury myself' and 'hidden' highlight that the speaker...",
      "options": [
        "wishes he could live permanently with Abuelita",
        "fears being seen by others when he hugs Abuelita",
        "feels safe and content with Abuelita",
        "is able to forget where he is when he is with Abuelita"
      ],
      "correct_answer": "feels safe and content with Abuelita",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 8,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Poetry Analysis",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "What is the most likely reason the poet uses exclamation points in the third stanza?",
      "options": [
        "To emphasize how much respect the speaker has for Abuelita",
        "To show the speaker's excitement about his long visit with Abuelita",
        "To convey Papa's hesitation about leaving the speaker with Abuelita",
        "To highlight how long it has been since the speaker last saw Abuelita"
      ],
      "correct_answer": "To show the speaker's excitement about his long visit with Abuelita",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 9,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Figurative Language",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "The poet includes these similes most likely to...",
      "options": [
        "suggest that the speaker has not visited Abuelita in a long time",
        "help the reader visualize Abuelita's house",
        "identify the speaker's favorite holiday to spend with Abuelita",
        "help the reader imagine a specific place in Abuelita's house"
      ],
      "correct_answer": "help the reader visualize Abuelita's house",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 10,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Character Analysis",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "These lines are included to suggest that the speaker...",
      "options": [
        "wishes he could be taller than he is",
        "is embarrassed by the name Abuelita calls him",
        "thinks Abuelita is very amusing",
        "enjoys making Abuelita feel proud of him"
      ],
      "correct_answer": "enjoys making Abuelita feel proud of him",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 11,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Theme",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "From the speaker's experience, the reader can learn that...",
      "options": [
        "parents are to be appreciated",
        "happiness can be found in trying new things",
        "time spent with family should be cherished",
        "relationships can strengthen with time"
      ],
      "correct_answer": "time spent with family should be cherished",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 12,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Poetry Analysis",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "By including Abuelita's dialogue in the poem, the poet is able to...",
      "options": [
        "tell the qualities Abuelita likes about the speaker",
        "indicate what Abuelita and the speaker enjoy doing together",
        "reveal how Abuelita feels about the speaker",
        "suggest that Abuelita enjoys speaking Spanish with the speaker"
      ],
      "correct_answer": "reveal how Abuelita feels about the speaker",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 13,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Theme Development",
      "type": "multiple-choice",
      "passageId": 2,
      "question": "How does the poet develop the theme of this poem?",
      "options": [
        "By comparing the actions of Papa and Abuelita",
        "By explaining the reasons the speaker visits Abuelita",
        "By telling about the photographs in Abuelita's house",
        "By describing the speaker's interaction with Abuelita"
      ],
      "correct_answer": "By describing the speaker's interaction with Abuelita",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 14,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Vocabulary",
      "type": "multiple-choice",
      "passageId": 3,
      "question": "Which words from paragraph 2 help the reader understand the meaning of engaged?",
      "options": [
        "charm as a person",
        "sat for a portrait",
        "practiced at the time",
        "interesting conversation"
      ],
      "correct_answer": "interesting conversation",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 15,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Main Idea",
      "type": "multiple-choice",
      "passageId": 3,
      "question": "Paragraph 2 is mainly about the...",
      "options": [
        "method Stuart used when he was painting portraits",
        "number of portraits Stuart painted during his lifetime",
        "reason Stuart wanted to paint portraits of famous people",
        "popularity of the portraits Stuart painted during his lifetime"
      ],
      "correct_answer": "method Stuart used when he was painting portraits",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 16,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Inference",
      "type": "multiple-choice",
      "passageId": 3,
      "question": "The reader can conclude from the information in paragraph 3 that Stuart...",
      "options": [
        "worried that his portrait would not please Washington",
        "was determined to create a portrait of Washington",
        "was nervous in the presence of Washington",
        "shared similar interests with Washington"
      ],
      "correct_answer": "was determined to create a portrait of Washington",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 17,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Author's Purpose",
      "type": "multiple-choice",
      "passageId": 3,
      "question": "The author includes the details in paragraph 5 most likely to...",
      "options": [
        "explain why this particular portrait of Washington is so well known",
        "express regret that the painting of Washington became famous only after Stuart's death",
        "demonstrate that Washington was an important figure in history",
        "emphasize that most of Washington's portraits were left unfinished"
      ],
      "correct_answer": "explain why this particular portrait of Washington is so well known",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 18,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Summary",
      "type": "multiple-choice",
      "passageId": 3,
      "question": "What is the best summary of the selection?",
      "options": [
        "In 1796 painter Gilbert Stuart had the opportunity to paint a portrait of George Washington. It had been difficult to arrange time for the two men to get together. While Stuart painted Washington, the two men talked about horses.",
        "The most famous portrait of George Washington was painted by Gilbert Stuart, who lived from 1755 to 1828. Stuart painted portraits of other famous people as well. He never finished his portrait of Washington, but Stuart kept the original and sold copies of it anyway.",
        "An accomplished painter who completed hundreds of portraits, Gilbert Stuart lived from 1755 to 1828. Stuart wanted the subjects of his portraits to feel relaxed so that he could create a portrait of them that looked natural. One of Stuart's most famous paintings is a portrait of President George Washington.",
        "During his career Gilbert Stuart painted portraits of many famous people, including George Washington. Although Stuart was unable to complete a portrait of Washington during the time they had together in 1796, the work became the most popular portrait of Washington ever painted."
      ],
      "correct_answer": "During his career Gilbert Stuart painted portraits of many famous people, including George Washington. Although Stuart was unable to complete a portrait of Washington during the time they had together in 1796, the work became the most popular portrait of Washington ever painted.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 19,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Vocabulary",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "The origin of the word amass helps the reader understand that amassed in paragraph 3 means...",
      "options": [
        "searched for",
        "shared with a group",
        "gathered together",
        "stored in a safe place"
      ],
      "correct_answer": "gathered together",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 20,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Structure",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "By using a problem-and-solution organizational pattern in paragraphs 3 through 5, the author of the selection is able to...",
      "options": [
        "demonstrate that Tolkien needed help completing his book and describe how only certain parts of his story were used",
        "show that Christopher needed to work with another author and tell how he was able to persuade his friend to work with him",
        "highlight that Christopher had trouble deciding which of his father's writings to include in the book and identify how he made his choices",
        "emphasize that Tolkien could not finish his book and explain how Christopher's efforts led to the completion and publication of the work"
      ],
      "correct_answer": "emphasize that Tolkien could not finish his book and explain how Christopher's efforts led to the completion and publication of the work",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 21,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Inference",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "Based on the information in paragraph 5, the reader can conclude that Christopher...",
      "options": [
        "had little prior experience writing books",
        "tried to include alternate endings in the book",
        "encountered many challenges while organizing the book",
        "planned to publish more than one book of his father's work"
      ],
      "correct_answer": "encountered many challenges while organizing the book",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 22,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Evidence",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "According to the selection, why did Christopher decide not to include all his father's writings in The Silmarillion?",
      "options": [
        "He believed they would cause the reader to become very confused.",
        "He worried that some of the ideas would be unfamiliar to the reader.",
        "He planned to create a different ending for the story.",
        "He wanted the final book to have only five parts."
      ],
      "correct_answer": "He believed they would cause the reader to become very confused.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 23,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Author's Attitude",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "Which sentence best shows the author of the selection's attitude toward the writing of The Silmarillion?",
      "options": [
        "The Silmarillion can be thought of as a prequel to The Hobbit and The Lord of the Rings.",
        "But the story of how The Silmarillion was created may be just as interesting as the story told on its pages.",
        "Kay's work on The Silmarillion undoubtedly provided training and valuable experience on his journey to become an author.",
        "The Silmarillion was published in 1977 to mixed reviews."
      ],
      "correct_answer": "But the story of how The Silmarillion was created may be just as interesting as the story told on its pages.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 24,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Features",
      "type": "multiple-choice",
      "passageId": 4,
      "question": "What makes The Silmarillion unique among Tolkien's writings?",
      "options": [
        "The story takes place in an imaginary land.",
        "It was the only piece of writing published after his death.",
        "The story includes fictional creatures and humans.",
        "It was both the first and last book he ever worked on."
      ],
      "correct_answer": "It was both the first and last book he ever worked on.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 25,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Comparison",
      "type": "multiple-choice",
      "passageId": [3, 4],
      "question": "Which sentence from the second selection shows that Tolkien's The Silmarillion was not as well received as Stuart's portrait of Washington?",
      "options": [
        "It is an account of the history of this fantasy world before The Hobbit takes place.",
        "Some stories required organizing, and some parts were still incomplete and needed finishing.",
        "Some people believed it was too different from what they had come to expect from Tolkien's writing.",
        "They knew that Christopher had started the task with many incomplete pieces."
      ],
      "correct_answer": "Some people believed it was too different from what they had come to expect from Tolkien's writing.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 26,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Comparison",
      "type": "multiple-choice",
      "passageId": [3, 4],
      "question": "One similarity between painter Gilbert Stuart and author J. R. R. Tolkien is that both men...",
      "options": [
        "were accomplished in their field of creative art",
        "spent several decades working on a single project",
        "needed the assistance of another person to complete their work",
        "were known for their interest in having conversations with others"
      ],
      "correct_answer": "were accomplished in their field of creative art",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 27,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Comparison",
      "type": "multiple-choice",
      "passageId": [3, 4],
      "question": "One difference between the portrait and the book discussed in the selections is that...",
      "options": [
        "copies of the incomplete portrait were sold, but the book was sold only after it was completed",
        "few people saw the portrait while Stuart was alive, but many saw the book manuscript while Tolkien was alive",
        "Stuart did not prepare before he painted his portrait, but Tolkien spent time preparing to write his book",
        "the portrait was not considered Stuart's best work, but the book was considered Tolkien's masterpiece"
      ],
      "correct_answer": "copies of the incomplete portrait were sold, but the book was sold only after it was completed",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 28,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Comparison",
      "type": "multiple-choice",
      "passageId": [3, 4],
      "question": "In what way are the portrait of George Washington and the book The Silmarillion similar?",
      "options": [
        "Each earned a great amount of money for its creator.",
        "Each remained incomplete at the time of its creator's death.",
        "Each was included in a larger body of work that its creator had made.",
        "Each required that people other than its creator work on it."
      ],
      "correct_answer": "Each remained incomplete at the time of its creator's death.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 29,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Theme",
      "type": "multiple-choice",
      "passageId": 5,
      "question": "What is the primary theme of the story?",
      "options": [
        "Sharing with others helps develop strong relationships.",
        "Focusing on work can produce great rewards.",
        "Role models often have faults.",
        "Greed can have harmful consequences."
      ],
      "correct_answer": "Greed can have harmful consequences.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 30,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Tone",
      "type": "multiple-choice",
      "passageId": 5,
      "question": "The raven's words in paragraph 4 ('Don't be afraid, I'll pay you...') can best be described as...",
      "options": [
        "comforting",
        "mocking",
        "insincere",
        "joyful"
      ],
      "correct_answer": "comforting",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 31,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Character Analysis",
      "type": "multiple-choice",
      "passageId": 5,
      "question": "The actions of the younger brother in paragraph 7 are significant because they show that...",
      "options": [
        "he is more interested in flying than in growing star fruit",
        "his relationship with the raven is beneficial only to him",
        "his attitude toward wealth protects him from harm",
        "he depends on the raven to show him the best way to help his brother"
      ],
      "correct_answer": "his attitude toward wealth protects him from harm",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 32,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Conflict",
      "type": "multiple-choice",
      "passageId": 5,
      "question": "What is the main problem in the story?",
      "options": [
        "One brother is left an unusually small inheritance.",
        "One brother is never satisfied with what he has.",
        "One brother does not know how to spend money wisely.",
        "One brother shares his wealth with others who are in need."
      ],
      "correct_answer": "One brother is never satisfied with what he has.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 33,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Summary",
      "type": "multiple-choice",
      "passageId": 5,
      "question": "Which of the following is the best summary of paragraphs 8 through 10?",
      "options": [
        "The younger brother invites the older brother to dinner several times. The older brother finally agrees and is surprised when he sees the younger one's house. After being told the story of the raven, the older brother wants to trade his inheritance for what his brother has. The younger brother refuses.",
        "One day the older brother goes to the younger brother's house for dinner and is surprised by what he sees. He likes his brother's house so much that he offers to trade his inheritance for it. The younger brother does not want to trade, however, and refuses the other's offer.",
        "The younger brother repeatedly pleads with the older brother to come over for dinner. When the older brother finally comes over, he asks the younger brother where he got all the fine things in his house. The younger brother then tells his brother about the raven.",
        "The younger brother repeatedly invites the older brother to dinner. The older brother finally comes over after refusing this request many times. The younger brother tells him about the raven that came to the star fruit tree. The older brother wants to own the tree so that he can meet the raven."
      ],
      "correct_answer": "The younger brother invites the older brother to dinner several times. The older brother finally agrees and is surprised when he sees the younger one's house. After being told the story of the raven, the older brother wants to trade his inheritance for what his brother has. The younger brother refuses.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 34,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Vocabulary",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "Read the dictionary entry... Which definition best matches the way the word credited is used in paragraph 6?",
      "options": [
        "Definition 1",
        "Definition 2",
        "Definition 3",
        "Definition 4"
      ],
      "correct_answer": "Definition 2",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 35,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Features",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "The map next to paragraph 2 helps the reader better understand the information in the selection because it...",
      "options": [
        "illustrates how wide Lake Maracaibo is",
        "provides the names of other countries in South America",
        "helps the reader understand the causes of the lightning in Venezuela",
        "shows the reader where the lightning occurs in Venezuela"
      ],
      "correct_answer": "shows the reader where the lightning occurs in Venezuela",
      "image_url": "map_venezuela.jpg",
      "image_position": "before"
    },
    {
      "id": 36,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Structure",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "By stating a main idea and supporting it with specific details in paragraphs 2 through 4, the author is able to...",
      "options": [
        "offer a vivid picture of what the Catatumbo Lightning looks like to observers",
        "give a thorough explanation of why the Catatumbo Lightning is unique",
        "add a sense of drama and suspense regarding the Catatumbo Lightning strikes",
        "provide scientific reasons for the colorful display during a Catatumbo Lightning storm"
      ],
      "correct_answer": "give a thorough explanation of why the Catatumbo Lightning is unique",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 37,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Main Idea",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "The main idea of paragraphs 8 and 9 is that...",
      "options": [
        "an increase in methane gas in the area may be responsible for the lightning",
        "there are some theories about what causes the lightning but no definite answer",
        "the lightning may be caused by warm air from a river and a lake meeting cool mountain air",
        "when lightning strikes stopped during a drought, scientists studied how weather affects the lightning"
      ],
      "correct_answer": "there are some theories about what causes the lightning but no definite answer",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 38,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Text Evidence",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "Which of these facts from the selection supports the idea that the local people embrace the Catatumbo Lightning?",
      "options": [
        "This natural phenomenon is called the Relámpago del Catatumbo, or the Catatumbo Lightning.",
        "The color of the lightning changes depending on the presence of dust, water, and various gases in the air.",
        "The lightning is mentioned in poetry and songs; the state of Zulia even has a lightning bolt on its flag.",
        "The mystery of what causes the lightning deepened when, beginning in January 2010, the lightning did not appear for a period of several months."
      ],
      "correct_answer": "The lightning is mentioned in poetry and songs; the state of Zulia even has a lightning bolt on its flag.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 39,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Inference",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "Based on the information throughout the selection, how do the native people of Zulia feel about the Catatumbo Lightning?",
      "options": [
        "They are indifferent to it.",
        "They fear it as a powerful force of nature.",
        "They believe it is problematic for their community.",
        "They appreciate it as a special feature of their area."
      ],
      "correct_answer": "They appreciate it as a special feature of their area.",
      "image_url": null,
      "image_position": "after"
    },
    {
      "id": 40,
      "subject": "ela",
      "grade": "6",
      "location": "USA",
      "topic": "Author's Purpose",
      "type": "multiple-choice",
      "passageId": 6,
      "question": "The author's main purpose for writing this selection is to...",
      "options": [
        "warn readers about the dangers of lightning",
        "discuss the mysterious lightning found in a region",
        "compare and contrast lightning storms around the world",
        "explain the weather conditions that cause lightning"
      ],
      "correct_answer": "discuss the mysterious lightning found in a region",
      "image_url": null,
      "image_position": "after"
    }
  ],
  "passages": [
    {
      "id": 1,
      "title": "The Regulars",
      "text": "1 'Turkey Melt,' 'Corned Beef on Rye,' and 'Ham and Cheese' waved good-bye. 2 They were three of the regulars at my parents' deli. 3 Every day Mr. and Mrs. Sandlin shared a turkey-melt sandwich, Mr. Augsburger had a corned beef on rye bread, and Mr. Bates ordered ham and cheese on whole wheat from his perch on the stool beside the cash register. 4 I didn't even know their real names until one very eventful day at the deli. 5 It was the day of the Twin Rivers Summer Festival, and I had just been told that I had to help at the deli that afternoon instead of enjoying the event with my friends Lisa and Carlos. ... [Full Text from PDF] ... 32 Carefully, I began making a turkey melt, a corned beef on rye, and a ham-and-cheese sandwich on whole wheat bread.",
      "images": ["image_deli_scene.jpg"]
    }
  ]
}
